Checking the problems before solution

In [3]:
import pandas as pd
import numpy as np

In [ ]:
students = {
    "student_id" : [1,2,3,4,5,6,7,8],
    "first" : ["Anish", "Ramish",None, "Samish", np.nan,"Bamish", np.nan, 'NA'],
    "last" : ["Khadka", "Mainali", "Shrestha", "Karki", "Mainali", np.nan, np.nan, 'Missing'],
    "email" : [None, "mainaliramish89@gmail.com", 
               "shresthasamish28@gmail.com", None,"bamishkarki819@gmail.com",
               "mainaliramish89@gmail.com", np.nan, 'Missing'],
    "age": ['23', '24', '22', '26', '27', None, None, 'Missing']

}
mydf = pd.DataFrame(students)
mydf.set_index('student_id', inplace=True)
mydf

             first      last                       email      age
student_id
1            Anish    Khadka                        None       23
2           Ramish   Mainali   mainaliramish89@gmail.com       24
3             None  Shrestha  shresthasamish28@gmail.com       22
4           Samish     Karki                        None       26
5              NaN   Mainali    bamishkarki819@gmail.com       27
6           Bamish       NaN   mainaliramish89@gmail.com     None
7              NaN       NaN                         NaN     None
8               NA   Missing                     Missing  Missing

In [4]:
mydf.replace(['Missing', 'None', 'NA', None], np.nan, inplace=True)
mydf

             first      last                       email  age
student_id
1            Anish    Khadka                         NaN   23
2           Ramish   Mainali   mainaliramish89@gmail.com   24
3              NaN  Shrestha  shresthasamish28@gmail.com   22
4           Samish     Karki                         NaN   26
5              NaN   Mainali    bamishkarki819@gmail.com   27
6           Bamish       NaN   mainaliramish89@gmail.com  NaN
7              NaN       NaN                         NaN  NaN
8              NaN       NaN                         NaN  NaN

In [5]:
# mydf.loc[mydf['email'].duplicated(keep='first'), 'email'] = np.nan

In [6]:
mydf

             first      last                       email  age
student_id
1            Anish    Khadka                         NaN   23
2           Ramish   Mainali   mainaliramish89@gmail.com   24
3              NaN  Shrestha  shresthasamish28@gmail.com   22
4           Samish     Karki                         NaN   26
5              NaN   Mainali    bamishkarki819@gmail.com   27
6           Bamish       NaN   mainaliramish89@gmail.com  NaN
7              NaN       NaN                         NaN  NaN
8              NaN       NaN                         NaN  NaN

In [7]:
# Keeping only unique values
mydf.drop_duplicates(subset=['email'], keep='first', inplace=True)
mydf

             first      last                       email age
student_id
1            Anish    Khadka                         NaN  23
2           Ramish   Mainali   mainaliramish89@gmail.com  24
3              NaN  Shrestha  shresthasamish28@gmail.com  22
5              NaN   Mainali    bamishkarki819@gmail.com  27

Q. Keep only the unique values in email, keep the first occurence.

In [8]:
# mydf.drop_duplicates(subset=['email'], keep='first')

In [9]:
import pandas as pd

def createBonusColumn(employees: pd.DataFrame) -> pd.DataFrame:
    employees['bonus'] = 2 * employees['salary']
    return employees

In [10]:
import pandas as pd

def selectData(students: pd.DataFrame) -> pd.DataFrame:
    filt = (students['student_id'] == 101)
    return students.loc[filt][['name', 'age']]

In [11]:
import pandas as pd

def dropMissingData(students: pd.DataFrame) -> pd.DataFrame:
    students = students.dropna(subset=['name'])
    return students

In [12]:
import pandas as pd

def modifySalaryColumn(employees: pd.DataFrame) -> pd.DataFrame:
    employees['salary'] = 2 * employees['salary']
    return employees

In [13]:
import pandas as pd

def renameColumns(students: pd.DataFrame) -> pd.DataFrame:
    students.rename(columns={'id':'student_id', 'first':'first_name', 'last':'last_name', 'age':'age_in_years'}, inplace=True)
    return students

In [14]:
import pandas as pd

def changeDatatype(students: pd.DataFrame) -> pd.DataFrame:
    students['grade'] = students['grade'].astype(int)
    return students

In [15]:
import pandas as pd
import numpy as np

# Sample DataFrame with missing values (None, np.nan)
data = {
    'student_id': [1, 2, 3, 4],
    'name': ['Alice', None, 'Bob', 'Charlie'],
    'age': [20, np.nan, 22, None]
}
students = pd.DataFrame(data)

# Fill all missing values with 0
students = students.fillna(0)

# Display the result
print(students)

   student_id     name   age
0           1    Alice  20.0
1           2        0   0.0
2           3      Bob  22.0
3           4  Charlie   0.0

In [16]:
def fillMissingValues(products: pd.DataFrame) -> pd.DataFrame:
    products['quantity'] = products['quantity'].fillna(0)
    return products

In [17]:
def concatenateTables(df1: pd.DataFrame, df2: pd.DataFrame) -> pd.DataFrame:
    return pd.concat([df1, df2], ignore_index=True)

In [18]:
import pandas as pd

def pivotTable(weather: pd.DataFrame) -> pd.DataFrame:
    return weather.pivot(index='month', columns='city', values='temperature')

In [19]:
# SELECT product_id
# FROM Products
# WHERE low_fats = 'Y' AND recyclable = 'Y';

import pandas as pd

def filterProducts(products: pd.DataFrame) -> pd.DataFrame:
    return products.loc[(products['low_fats'] == 'Y') & (products['recyclable'] == 'Y'), ['product_id']]

In [20]:
# SELECT name, population, area FROM World
# WHERE area >= 3000000 OR population >= 25000000;
import pandas as pd

def filterWorld(world: pd.DataFrame) -> pd.DataFrame:
    return world.loc[(world['area'] >= 3000000) | (world['population'] >= 25000000), ['name', 'population', 'area']]

In [21]:
# SELECT DISTINCT author_id id FROM Views
# WHERE author_id = viewer_id
# ORDER BY id ASC;
import pandas as pd

def filterViews(views: pd.DataFrame) -> pd.DataFrame:
    return views.loc[views['author_id'] == views['viewer_id'], ['author_id']].drop_duplicates().rename(columns={'author_id': 'id'}).sort_values(by='id')

In [2]:
# SELECT tweet_id 
# FROM Tweets
# WHERE LENGTH(content) > 15;

import pandas as pd
data = {
    "tweet_id": [1, 2, 3],
    "content": ["Hello World!", "This is a long tweet!", "Short tweet"]
}

df = pd.DataFrame(data)
invalid_tweets = df[df["content"].str.len() > 15][["tweet_id"]]
invalid_tweets

   tweet_id
1         2

In [1]:
# SELECT COALESCE(eu.unique_id, NULL) AS unique_id, e.name
# FROM Employees e
# LEFT JOIN EmployeeUNI eu ON e.id = eu.id;

import pandas as pd

employees = pd.DataFrame({
    'id': [1, 7, 11, 90, 3],
    'name': ['Alice', 'Bob', 'Meir', 'Winston', 'Jonathan']
})

employee_uni = pd.DataFrame({
    'id': [3, 11, 90],
    'unique_id': [1, 2, 3]
})

result = employees.merge(employee_uni, on='id', how='left')
result = result[['unique_id', 'name']]

print(result)

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan

In [1]:
# SELECT firstName, lastName, city, state 
# FROM Person 
# LEFT JOIN Address  ON Person.personId=Address.personId;
import pandas as pd

person = pd.DataFrame({
    'personId': [1, 2],
    'firstName': ['John', 'Jane'],
    'lastName': ['Doe', 'Smith']
})

address = pd.DataFrame({
    'addressId': [1],
    'personId': [1],
    'city': ['New York'],
    'state': ['NY']
})

result = person.merge(address, on='personId', how='left')
result = result[['firstName', 'lastName', 'city', 'state']]

print(result)

  firstName lastName      city state
0      John      Doe  New York    NY
1      Jane    Smith       NaN   NaN

In [ ]:
# # Solving inner join problem from Leetcode
# SELECT product_name, year, price 
# FROM Sales
# INNER JOIN Product 
# ON Product.product_id = Sales.product_id;

# Simulate inner join using merge
import pandas as pd

# Sample data for demonstration
sales_df = pd.DataFrame({
    'product_id': [1, 2, 3],
    'year': [2020, 2021, 2022],
    'price': [100, 150, 200]
})

product_df = pd.DataFrame({
    'product_id': [1, 2, 3],
    'product_name': ['Phone', 'Laptop', 'Tablet']
})

# Equivalent of the SQL INNER JOIN
result = pd.merge(sales_df, product_df, on='product_id', how='inner')

# Select the desired columns
result = result[['product_name', 'year', 'price']]

print(result)

In [ ]:
# Solving one more SQL problem today
# Write your MySQL query statement below
# SELECT customer_id, COUNT(*) count_no_trans 
# FROM Visits
# LEFT JOIN Transactions 
# ON Visits.visit_id = Transactions.visit_id
# WHERE Transactions.transaction_id IS NULL
# GROUP BY customer_id; 

import pandas as pd

# Define the Visits table
visits = pd.DataFrame({
    'visit_id': [1, 2, 4, 5, 6, 7, 8],
    'customer_id': [23, 9, 30, 54, 96, 54, 54]
})

# Define the Transactions table
transactions = pd.DataFrame({
    'transaction_id': [2, 3, 9, 12, 13],
    'visit_id': [5, 5, 5, 1, 2],
    'amount': [310, 300, 200, 910, 970]
})

# Step 1: LEFT JOIN visits with transactions on visit_id
merged_df = pd.merge(visits, transactions, on='visit_id', how='left')

# Step 2: Filter only those visits that had no transactions (i.e., transaction_id is NaN)
no_trans = merged_df[merged_df['transaction_id'].isna()]

# Step 3: Group by customer_id and count how many visits had no transactions
result = no_trans.groupby('customer_id').size().reset_index(name='count_no_trans')

# Step 4: Display the result
print(result)

In [1]:
# SELECT w1.id
# FROM Weather w1
# JOIN Weather w2
# ON DATEDIFF(w1.recordDate, w2.recordDate) = 1
# WHERE w1.temperature > w2.temperature;

import pandas as pd

# Sample Weather data
data = {
    'id': [1, 2, 3, 4],
    'recordDate': ['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04'],
    'temperature': [10, 25, 20, 30]
}

weather = pd.DataFrame(data)

# Step 1: Convert recordDate to datetime
weather['recordDate'] = pd.to_datetime(weather['recordDate'])

# Step 2: Create a new DataFrame shifted by 1 day (to represent "yesterday")
yesterday = weather[['recordDate', 'temperature']]
yesterday['recordDate'] = yesterday['recordDate'] + pd.Timedelta(days=1)
yesterday = yesterday.rename(columns={'temperature': 'yesterday_temp'})

# Step 3: Merge current weather with yesterday's temperature
merged = pd.merge(weather, yesterday, on='recordDate', how='left')

# Step 4: Filter where today’s temperature > yesterday’s temperature
result = merged[merged['temperature'] > merged['yesterday_temp']]

# Step 5: Return only the 'id' column
output = result[['id']]

print(output)

   id
1   2
3   4

/tmp/ipykernel_54443/2475509206.py:23: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  yesterday['recordDate'] = yesterday['recordDate'] + pd.Timedelta(days=1)

In [1]:
# SELECT w1.id
# FROM Weather w1
# JOIN Weather w2
# ON DATEDIFF(w1.recordDate, w2.recordDate) = 1
# WHERE w1.temperature > w2.temperature;

import pandas as pd

# Sample Weather data
data = {
    'id': [1, 2, 3, 4],
    'recordDate': ['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04'],
    'temperature': [10, 25, 20, 30]
}

weather = pd.DataFrame(data)

# Step 1: Convert recordDate to datetime
weather['recordDate'] = pd.to_datetime(weather['recordDate'])

# Step 2: Create a new DataFrame shifted by 1 day (to represent "yesterday")
yesterday = weather[['recordDate', 'temperature']]
yesterday['recordDate'] = yesterday['recordDate'] + pd.Timedelta(days=1)
yesterday = yesterday.rename(columns={'temperature': 'yesterday_temp'})

# Step 3: Merge current weather with yesterday's temperature
merged = pd.merge(weather, yesterday, on='recordDate', how='left')

# Step 4: Filter where today’s temperature > yesterday’s temperature
result = merged[merged['temperature'] > merged['yesterday_temp']]

# Step 5: Return only the 'id' column
output = result[['id']]

print(output)

   id
1   2
3   4

/tmp/ipykernel_24790/2475509206.py:23: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  yesterday['recordDate'] = yesterday['recordDate'] + pd.Timedelta(days=1)

In [ ]:
# SELECT w1.id
# FROM Weather w1
# JOIN Weather w2
# ON DATEDIFF(w1.recordDate, w2.recordDate) = 1
# WHERE w1.temperature > w2.temperature;

import pandas as pd

# Sample Weather data
data = {
    'id': [1, 2, 3, 4],
    'recordDate': ['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04'],
    'temperature': [10, 25, 20, 30]
}

weather = pd.DataFrame(data)

# Step 1: Convert recordDate to datetime
weather['recordDate'] = pd.to_datetime(weather['recordDate'])

# Step 2: Create a new DataFrame shifted by 1 day (to represent "yesterday")
yesterday = weather[['recordDate', 'temperature']]
yesterday['recordDate'] = yesterday['recordDate'] + pd.Timedelta(days=1)
yesterday = yesterday.rename(columns={'temperature': 'yesterday_temp'})

# Step 3: Merge current weather with yesterday's temperature
merged = pd.merge(weather, yesterday, on='recordDate', how='left')

# Step 4: Filter where today’s temperature > yesterday’s temperature
result = merged[merged['temperature'] > merged['yesterday_temp']]

# Step 5: Return only the 'id' column
output = result[['id']]

print(output)

In [ ]:
# SELECT w1.id
# FROM Weather w1
# JOIN Weather w2
# ON DATEDIFF(w1.recordDate, w2.recordDate) = 1
# WHERE w1.temperature > w2.temperature;

import pandas as pd

# Sample Weather data
data = {
    'id': [1, 2, 3, 4],
    'recordDate': ['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04'],
    'temperature': [10, 25, 20, 30]
}

weather = pd.DataFrame(data)

# Step 1: Convert recordDate to datetime
weather['recordDate'] = pd.to_datetime(weather['recordDate'])

# Step 2: Create a new DataFrame shifted by 1 day (to represent "yesterday")
yesterday = weather[['recordDate', 'temperature']]
yesterday['recordDate'] = yesterday['recordDate'] + pd.Timedelta(days=1)
yesterday = yesterday.rename(columns={'temperature': 'yesterday_temp'})

# Step 3: Merge current weather with yesterday's temperature
merged = pd.merge(weather, yesterday, on='recordDate', how='left')

# Step 4: Filter where today’s temperature > yesterday’s temperature
result = merged[merged['temperature'] > merged['yesterday_temp']]

# Step 5: Return only the 'id' column
output = result[['id']]

print(output)